Steps for Data Analysis:
    1. Data Loading
    2. Data Cleaning
    3. Data Transforming
    4. Data Rearrangment

In [1]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
%matplotlib inline

# 7.1 Handling Missing Data

In [2]:
string_data = pd.Series(data=['Apple', 'Orange', np.nan, 'Banana'])

In [3]:
string_data

0     Apple
1    Orange
2       NaN
3    Banana
dtype: object

NaN(Not a Number)

In [4]:
string_data.isnull()

0    False
1    False
2     True
3    False
dtype: bool

NA (Not Available)

In [5]:
string_data[0] = None

In [6]:
string_data

0      None
1    Orange
2       NaN
3    Banana
dtype: object

In [7]:
string_data.isnull()

0     True
1    False
2     True
3    False
dtype: bool

Table 7-1. NA handling methods

In [8]:
df = pd.DataFrame(data=np.random.randn(1024,5), index=np.arange(1024), columns=list('ABCDE'))

In [9]:
df

             A         B         C         D         E
0     0.174528 -1.593428  0.246567  1.342950 -0.521441
1     0.351270 -0.355010  0.472036 -0.664019  1.610938
2     1.822580 -0.900391 -0.243351 -1.076532  0.103432
3     0.633548  1.701642  1.182074  2.012732 -0.763786
4     1.473584 -0.330367  1.005004 -0.190411  0.018640
...        ...       ...       ...       ...       ...
1019 -1.782064  1.415784 -1.142679 -0.850528  1.445037
1020 -0.583946 -0.491979  0.881464  0.279406 -1.246850
1021 -0.943032  1.281033 -0.619047  1.357003 -1.437074
1022 -0.401629  1.139404 -0.946334 -1.041762 -1.718283
1023  0.244300 -0.207533  0.493274  1.479678 -0.254918

[1024 rows x 5 columns]

In [10]:
df.loc[5][['C', 'D']] = np.nan
df.loc[1021]['A'] = np.nan
df.loc[5] = np.nan

In [11]:
df

             A         B         C         D         E
0     0.174528 -1.593428  0.246567  1.342950 -0.521441
1     0.351270 -0.355010  0.472036 -0.664019  1.610938
2     1.822580 -0.900391 -0.243351 -1.076532  0.103432
3     0.633548  1.701642  1.182074  2.012732 -0.763786
4     1.473584 -0.330367  1.005004 -0.190411  0.018640
...        ...       ...       ...       ...       ...
1019 -1.782064  1.415784 -1.142679 -0.850528  1.445037
1020 -0.583946 -0.491979  0.881464  0.279406 -1.246850
1021       NaN  1.281033 -0.619047  1.357003 -1.437074
1022 -0.401629  1.139404 -0.946334 -1.041762 -1.718283
1023  0.244300 -0.207533  0.493274  1.479678 -0.254918

[1024 rows x 5 columns]

In [12]:
df[(df.isnull()).any(1)]

       A         B         C         D         E
5    NaN       NaN       NaN       NaN       NaN
1021 NaN  1.281033 -0.619047  1.357003 -1.437074

In [13]:
df.dropna(thresh=2)

             A         B         C         D         E
0     0.174528 -1.593428  0.246567  1.342950 -0.521441
1     0.351270 -0.355010  0.472036 -0.664019  1.610938
2     1.822580 -0.900391 -0.243351 -1.076532  0.103432
3     0.633548  1.701642  1.182074  2.012732 -0.763786
4     1.473584 -0.330367  1.005004 -0.190411  0.018640
...        ...       ...       ...       ...       ...
1019 -1.782064  1.415784 -1.142679 -0.850528  1.445037
1020 -0.583946 -0.491979  0.881464  0.279406 -1.246850
1021       NaN  1.281033 -0.619047  1.357003 -1.437074
1022 -0.401629  1.139404 -0.946334 -1.041762 -1.718283
1023  0.244300 -0.207533  0.493274  1.479678 -0.254918

[1023 rows x 5 columns]

In [14]:
df.fillna(value=0)

             A         B         C         D         E
0     0.174528 -1.593428  0.246567  1.342950 -0.521441
1     0.351270 -0.355010  0.472036 -0.664019  1.610938
2     1.822580 -0.900391 -0.243351 -1.076532  0.103432
3     0.633548  1.701642  1.182074  2.012732 -0.763786
4     1.473584 -0.330367  1.005004 -0.190411  0.018640
...        ...       ...       ...       ...       ...
1019 -1.782064  1.415784 -1.142679 -0.850528  1.445037
1020 -0.583946 -0.491979  0.881464  0.279406 -1.246850
1021  0.000000  1.281033 -0.619047  1.357003 -1.437074
1022 -0.401629  1.139404 -0.946334 -1.041762 -1.718283
1023  0.244300 -0.207533  0.493274  1.479678 -0.254918

[1024 rows x 5 columns]

## Filtering Out Missing Data

In [15]:
data = pd.Series(data=[1, 5, np.nan, 7, 9, np.nan])

In [16]:
data

0    1.0
1    5.0
2    NaN
3    7.0
4    9.0
5    NaN
dtype: float64

In [17]:
data.dropna()

0    1.0
1    5.0
3    7.0
4    9.0
dtype: float64

equivalent to:

In [18]:
data[data.notnull()]

0    1.0
1    5.0
3    7.0
4    9.0
dtype: float64

In [19]:
data = pd.DataFrame([[1., 6.5, 3.], [1., np.nan, np.nan], [np.nan, np.nan, np.nan], [np.nan, 6.5, 3.]])

In [20]:
data

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [21]:
cleaned = data.dropna()

In [22]:
cleaned

     0    1    2
0  1.0  6.5  3.0

In [23]:
#Passing how='all' will only drop rows that are all NA:
data.dropna(how='all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
3  NaN  6.5  3.0

In [24]:
data[4] = np.nan

In [25]:
data

     0    1    2   4
0  1.0  6.5  3.0 NaN
1  1.0  NaN  NaN NaN
2  NaN  NaN  NaN NaN
3  NaN  6.5  3.0 NaN

In [26]:
#To drop columns in the same way, pass axis=1
data.dropna(how='all', axis=1)

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [27]:
df = pd.DataFrame(data=np.random.randn(5,3))

In [28]:
df

          0         1         2
0  0.655129  1.629357  0.996413
1  0.551365  0.849895 -0.851984
2 -0.891503  0.062790 -0.613856
3  0.833369  0.028153  1.673192
4 -1.012075 -0.359620  2.014329

In [29]:
df.iloc[:2,1] = np.nan

In [30]:
df.iloc[:3,2] = np.nan

In [31]:
df

          0         1         2
0  0.655129       NaN       NaN
1  0.551365       NaN       NaN
2 -0.891503  0.062790       NaN
3  0.833369  0.028153  1.673192
4 -1.012075 -0.359620  2.014329

In [32]:
df.dropna()

          0         1         2
3  0.833369  0.028153  1.673192
4 -1.012075 -0.359620  2.014329

In [33]:
#Keep only the rows with at least thresh='2' non-NA values.
df.dropna(thresh=2)

          0         1         2
2 -0.891503  0.062790       NaN
3  0.833369  0.028153  1.673192
4 -1.012075 -0.359620  2.014329

## Filling In Missing Data

Rather than filtering out missing data (and potentially discarding other data along
with it), you may want to fill in the “holes” in any number of ways.

In [34]:
df

          0         1         2
0  0.655129       NaN       NaN
1  0.551365       NaN       NaN
2 -0.891503  0.062790       NaN
3  0.833369  0.028153  1.673192
4 -1.012075 -0.359620  2.014329

In [35]:
df.fillna(value=0)

          0         1         2
0  0.655129  0.000000  0.000000
1  0.551365  0.000000  0.000000
2 -0.891503  0.062790  0.000000
3  0.833369  0.028153  1.673192
4 -1.012075 -0.359620  2.014329

In [36]:
#Calling fillna with a dict, you can use a different fill value for each column:
df.fillna(value={0:100, 1:200, 2:300})

          0           1           2
0  0.655129  200.000000  300.000000
1  0.551365  200.000000  300.000000
2 -0.891503    0.062790  300.000000
3  0.833369    0.028153    1.673192
4 -1.012075   -0.359620    2.014329

In [37]:
df.fillna(value=0, inplace=True)

In [38]:
df

          0         1         2
0  0.655129  0.000000  0.000000
1  0.551365  0.000000  0.000000
2 -0.891503  0.062790  0.000000
3  0.833369  0.028153  1.673192
4 -1.012075 -0.359620  2.014329

In [39]:
df = pd.DataFrame(np.random.randn(7, 4))

In [40]:
df

          0         1         2         3
0  1.089226  0.938180  0.133069  0.782136
1  1.452777  1.106967  1.532692  0.050871
2  0.810425 -1.452205 -0.787204 -1.737212
3 -0.288386  0.563872 -1.055143  0.525982
4  0.276271  0.170269  0.513419  0.569988
5  1.453330  1.353726 -0.837788  0.635617
6  0.666619 -0.664585 -1.758453 -1.133159

In [41]:
df.loc[2:4,2] = np.nan

In [42]:
df.iloc[-1:-5:-1,0] = np.nan

In [43]:
df

          0         1         2         3
0  1.089226  0.938180  0.133069  0.782136
1  1.452777  1.106967  1.532692  0.050871
2  0.810425 -1.452205       NaN -1.737212
3       NaN  0.563872       NaN  0.525982
4       NaN  0.170269       NaN  0.569988
5       NaN  1.353726 -0.837788  0.635617
6       NaN -0.664585 -1.758453 -1.133159

In [44]:
df.fillna(method='ffill')

          0         1         2         3
0  1.089226  0.938180  0.133069  0.782136
1  1.452777  1.106967  1.532692  0.050871
2  0.810425 -1.452205  1.532692 -1.737212
3  0.810425  0.563872  1.532692  0.525982
4  0.810425  0.170269  1.532692  0.569988
5  0.810425  1.353726 -0.837788  0.635617
6  0.810425 -0.664585 -1.758453 -1.133159

In [45]:
df.fillna(method='bfill')

          0         1         2         3
0  1.089226  0.938180  0.133069  0.782136
1  1.452777  1.106967  1.532692  0.050871
2  0.810425 -1.452205 -0.837788 -1.737212
3       NaN  0.563872 -0.837788  0.525982
4       NaN  0.170269 -0.837788  0.569988
5       NaN  1.353726 -0.837788  0.635617
6       NaN -0.664585 -1.758453 -1.133159

In [46]:
df.fillna(method='ffill', limit=3)

          0         1         2         3
0  1.089226  0.938180  0.133069  0.782136
1  1.452777  1.106967  1.532692  0.050871
2  0.810425 -1.452205  1.532692 -1.737212
3  0.810425  0.563872  1.532692  0.525982
4  0.810425  0.170269  1.532692  0.569988
5  0.810425  1.353726 -0.837788  0.635617
6       NaN -0.664585 -1.758453 -1.133159

In [47]:
ser = pd.Series(data=[2, 5.3, np.nan, 7, np.nan, 87, 1.25])

In [48]:
ser

0     2.00
1     5.30
2      NaN
3     7.00
4      NaN
5    87.00
6     1.25
dtype: float64

In [49]:
ser.fillna(value=np.mean(ser))

0     2.00
1     5.30
2    20.51
3     7.00
4    20.51
5    87.00
6     1.25
dtype: float64

Table 7-2. fillna function arguments

# 7.2 Data Transformation

## Removing Duplicates

In [50]:
df = pd.DataFrame(data={'k1': ['one', 'two']*3 + ['two'], 'k2': [1, 1, 2, 2, 3, 3, 3]})

In [51]:
df

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   2
4  one   3
5  two   3
6  two   3

In [52]:
# duplicated returns a boolean Series indicating whether each row is a duplicate (has been observed in a previous row) or not:
df.duplicated(keep='first')

0    False
1    False
2    False
3    False
4    False
5    False
6     True
dtype: bool

In [53]:
df.duplicated(keep='last')

0    False
1    False
2    False
3    False
4    False
5     True
6    False
dtype: bool

In [54]:
df.drop_duplicates()

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   2
4  one   3
5  two   3

In [55]:
df.drop_duplicates(keep='last')

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   2
4  one   3
6  two   3

In [56]:
df['k3'] = range(7)

In [57]:
df

    k1  k2  k3
0  one   1   0
1  two   1   1
2  one   2   2
3  two   2   3
4  one   3   4
5  two   3   5
6  two   3   6

In [58]:
df.drop_duplicates(['k1', 'k2'])

    k1  k2  k3
0  one   1   0
1  two   1   1
2  one   2   2
3  two   2   3
4  one   3   4
5  two   3   5

In [59]:
df.drop_duplicates(['k1', 'k2'], keep='last')

    k1  k2  k3
0  one   1   0
1  two   1   1
2  one   2   2
3  two   2   3
4  one   3   4
6  two   3   6

## Transforming Data Using a Function or Mapping

In [60]:
data = pd.DataFrame({'food': ['bacon', 'pulled pork', 'bacon', 'Pastrami', 'corned beef', 'Bacon',
                              'pastrami', 'honey ham', 'nova lox'], 'ounces': [4, 3, 12, 6, 7.5, 8, 3, 5, 6]})

In [61]:
data

          food  ounces
0        bacon     4.0
1  pulled pork     3.0
2        bacon    12.0
3     Pastrami     6.0
4  corned beef     7.5
5        Bacon     8.0
6     pastrami     3.0
7    honey ham     5.0
8     nova lox     6.0

In [62]:
d = {'bacon':'pig', 'pulled pork':'pig', 'pastrami': 'cow', 'corned beef':'cow', 'honey ham': 'pig', 'nova lox': 'salmon'}

In [63]:
lowered_case = data['food'].str.lower()

In [64]:
lowered_case

0          bacon
1    pulled pork
2          bacon
3       pastrami
4    corned beef
5          bacon
6       pastrami
7      honey ham
8       nova lox
Name: food, dtype: object

In [65]:
data['animal'] = lowered_case.map(d)

In [66]:
data

          food  ounces  animal
0        bacon     4.0     pig
1  pulled pork     3.0     pig
2        bacon    12.0     pig
3     Pastrami     6.0     cow
4  corned beef     7.5     cow
5        Bacon     8.0     pig
6     pastrami     3.0     cow
7    honey ham     5.0     pig
8     nova lox     6.0  salmon

In [67]:
lowered_case.map(d)

0       pig
1       pig
2       pig
3       cow
4       cow
5       pig
6       cow
7       pig
8    salmon
Name: food, dtype: object

In [68]:
data['food'].map(lambda x: d[x.lower()])

0       pig
1       pig
2       pig
3       cow
4       cow
5       pig
6       cow
7       pig
8    salmon
Name: food, dtype: object

Using map is a convenient way to perform element-wise transformations and other
data cleaning–related operations.

## Replacing Values

In [69]:
ser = pd.Series(data=[8.52, 5, -85, 41.02, -85, 1000, 45, -9.0023, -85])

In [70]:
ser

0       8.5200
1       5.0000
2     -85.0000
3      41.0200
4     -85.0000
5    1000.0000
6      45.0000
7      -9.0023
8     -85.0000
dtype: float64

In [71]:
ser.replace(-85, 0)

0       8.5200
1       5.0000
2       0.0000
3      41.0200
4       0.0000
5    1000.0000
6      45.0000
7      -9.0023
8       0.0000
dtype: float64

In [72]:
ser.replace([-85, -9.0023], np.nan)

0       8.52
1       5.00
2        NaN
3      41.02
4        NaN
5    1000.00
6      45.00
7        NaN
8        NaN
dtype: float64

In [73]:
ser.replace([-85, -9.0023, 1000], [np.nan, np.nan, 0])

0     8.52
1     5.00
2      NaN
3    41.02
4      NaN
5     0.00
6    45.00
7      NaN
8      NaN
dtype: float64

In [74]:
ser.replace({-85:np.nan, -9.0023:np.nan, 1000:0})

0     8.52
1     5.00
2      NaN
3    41.02
4      NaN
5     0.00
6    45.00
7      NaN
8      NaN
dtype: float64

In [75]:
ser.replace(ser[ser<0], np.nan)

0       8.52
1       5.00
2        NaN
3      41.02
4        NaN
5    1000.00
6      45.00
7        NaN
8        NaN
dtype: float64

In [76]:
ser

0       8.5200
1       5.0000
2     -85.0000
3      41.0200
4     -85.0000
5    1000.0000
6      45.0000
7      -9.0023
8     -85.0000
dtype: float64

## Renaming Axis Indexes

Like values in a Series, axis labels can be similarly transformed by a function or mapping of some form to produce new, differently labeled objects

In [77]:
data = pd.DataFrame(np.arange(12).reshape((3, 4)), index=['Ohio', 'Colorado', 'New York'],
                    columns=['one', 'two', 'three', 'four'])

In [78]:
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
New York    8    9     10    11

In [79]:
data.index = data.index.map(lambda x: str.upper(x))

In [80]:
data

          one  two  three  four
OHIO        0    1      2     3
COLORADO    4    5      6     7
NEW YORK    8    9     10    11

In [81]:
data.rename(index=str.title, columns=str.upper)

          ONE  TWO  THREE  FOUR
Ohio        0    1      2     3
Colorado    4    5      6     7
New York    8    9     10    11

In [82]:
data.index.map(str.upper)

Index(['OHIO', 'COLORADO', 'NEW YORK'], dtype='object')

In [83]:
data.rename(index={'OHIO': 'NY'}, inplace=True)

In [84]:
data

          one  two  three  four
NY          0    1      2     3
COLORADO    4    5      6     7
NEW YORK    8    9     10    11

## Discretization and Binning

In [85]:
ages = [20, 22, 25, 27, 21, 69, 62, 58, 44, 23, 37, 31, 61, 45, 41, 32]

In [86]:
bins = [18, 25, 35, 60, 100]

In [87]:
cats = pd.cut(ages, bins)

In [88]:
cats

[(18, 25], (18, 25], (18, 25], (25, 35], (18, 25], ..., (25, 35], (60, 100], (35, 60], (35, 60], (25, 35]]
Length: 16
Categories (4, interval[int64]): [(18, 25] < (25, 35] < (35, 60] < (60, 100]]

The object pandas returns is a special Categorical object. The output you see
describes the bins computed by pandas.cut.

In [89]:
cats.codes # .codes attribute returns the label of catgories

array([0, 0, 0, 1, 0, 3, 3, 2, 2, 0, 2, 1, 3, 2, 2, 1], dtype=int8)

In [90]:
pd.value_counts(cats)

(35, 60]     5
(18, 25]     5
(60, 100]    3
(25, 35]     3
dtype: int64

Consistent with mathematical notation for intervals, a parenthesis means that the side
is open, while the square bracket means it is closed (inclusive).

In [91]:
bins

[18, 25, 35, 60, 100]

In [92]:
pd.cut(ages, [18, 26, 36, 61, 100], right=False)

[[18, 26), [18, 26), [18, 26), [26, 36), [18, 26), ..., [26, 36), [61, 100), [36, 61), [36, 61), [26, 36)]
Length: 16
Categories (4, interval[int64]): [[18, 26) < [26, 36) < [36, 61) < [61, 100)]

In [93]:
labels = ['Youth', 'YoungAdult', 'MiddleAged', 'Senior']

In [94]:
pd.cut(ages, bins, labels=labels)

[Youth, Youth, Youth, YoungAdult, Youth, ..., YoungAdult, Senior, MiddleAged, MiddleAged, YoungAdult]
Length: 16
Categories (4, object): [Youth < YoungAdult < MiddleAged < Senior]

If you pass an integer number of bins to cut instead of explicit bin edges, it will compute equal-length bins based on the minimum and maximum values in the data.
Consider the case of some uniformly distributed data chopped into fourths:

In [95]:
pd.cut(np.random.randn(10), 4, precision=2) #The precision=2 option limits the decimal precision to two digits.

[(-1.15, -0.47], (-0.47, 0.21], (-1.15, -0.47], (-1.15, -0.47], (-1.15, -0.47], (-0.47, 0.21], (-0.47, 0.21], (0.88, 1.56], (-1.15, -0.47], (-1.15, -0.47]]
Categories (4, interval[float64]): [(-1.15, -0.47] < (-0.47, 0.21] < (0.21, 0.88] < (0.88, 1.56]]

In [96]:
#qcuts returns the same size of bins (in Quartiles)
data = np.random.randn(1000)

In [97]:
data

array([ 0.07716193,  1.58686213,  0.96432038, -0.19701665,  0.98604389,
       -0.85781643, -1.31978042, -0.24707433, -0.68826381,  1.60774317,
       -1.19722342, -1.70494442,  2.32880145, -0.8162864 ,  0.86872226,
        1.66384409,  0.929642  ,  0.13282988, -0.81133042,  0.01334731,
       -0.84387386, -0.12357223, -1.78087267,  0.72681232, -2.33699113,
       -0.82943531,  1.31826699, -1.61925022,  1.13007576,  0.97743705,
       -0.46308572, -0.09255231,  0.23329226, -0.20930388, -0.24774335,
       -1.91156144, -2.16362943,  0.67365037,  0.72821414, -1.03454989,
       -0.13305451,  0.88872025,  2.51149903,  0.02819735,  1.25557686,
       -1.1951189 ,  0.10791966,  0.32720737,  1.79758532, -0.48875235,
       -0.37161276,  1.00869567, -0.95538653, -0.04460734,  0.07790759,
       -0.80216312,  1.08177005, -0.26313038,  1.07361978, -0.27700509,
        0.08866099, -0.19696793,  0.16646537,  0.84667954, -0.03931377,
        0.88057662,  0.09695848, -0.87497156, -0.36085318, -1.09456333,
        0.3679196 , -0.55845332, -0.18809362,  0.10057897, -1.88809794,
       -0.79026321,  2.17817503,  1.26365723, -1.9068205 , -0.85851779,
        0.50968821,  1.37396186,  0.60458675,  0.15191874,  0.99401149,
        0.17686663, -0.18894162, -1.31517339, -0.34701999, -1.67915822,
        1.12484964,  0.38633937, -1.73274356,  0.38390145, -1.64164184,
       -1.28820811, -0.1292543 ,  0.18258055, -1.12156238,  0.0937132 ,
        1.44213828,  0.99472687,  1.52887301, -0.16848997, -0.33235352,
        1.0326632 , -0.57974794,  0.82190017,  2.09533568,  0.2476673 ,
        1.31157375, -0.04308622,  2.68344006, -0.75475395,  0.22513284,
       -0.54814685,  0.87483328,  1.24792758, -1.30618113, -1.30489152,
        0.63225107, -0.61371153,  1.04104352,  0.04630442, -1.94681212,
        1.67918725, -0.5422559 , -0.58471922, -0.12994603, -0.08977294,
       -1.90340582,  0.1643814 ,  1.40063873, -0.36018909,  0.2568397 ,
       -0.30183855,  0.50825226, -0.14538239, -0.34481125, -0.08387052,
       -0.21793359,  1.84588622, -0.6016398 , -1.29086423, -0.49424713,
       -1.38703734,  0.73652942, -1.27046642, -1.29137879, -0.34714436,
        0.7116665 , -1.16700197, -0.13464762,  0.37914957, -0.6573671 ,
       -1.45736458,  1.22508663,  0.8616823 , -0.74102736, -0.14324367,
        0.35068802, -0.37231106, -1.76171738, -0.92807091, -0.93613515,
       -1.07444897, -0.6325457 , -0.39456589, -0.11218697,  1.43258173,
       -0.79508729, -0.67233264,  0.34024365,  0.03715834,  0.02015449,
        0.09820362,  0.41756423,  0.54958475, -1.52354279,  0.34761376,
        1.55457082, -0.27389627,  1.45046346, -1.31283363,  0.8524157 ,
       -0.7594499 ,  0.63817598,  0.25553817,  1.06534138, -0.4592037 ,
        0.16000517, -0.36287448,  1.5573207 , -0.68769645,  1.26397845,
        1.27745887,  0.37267097,  2.12776879, -0.99752392,  0.52131525,
       -0.0365256 ,  1.45389959,  0.02646739,  1.6079328 ,  0.21968562,
       -0.39566559, -1.58724076,  0.7144372 , -1.96218279,  0.6783984 ,
        1.54118503,  1.14925381,  0.13109214, -2.17213909,  1.30446672,
       -0.66339926,  0.98993291, -1.26250239,  0.5864173 , -0.08741385,
        0.97473192,  0.1273539 , -0.34396793,  0.02429864,  0.4730129 ,
        0.97017499, -0.16168079,  1.30352827, -0.53139315, -0.08075985,
        1.05553301, -0.13019817, -0.37796953,  0.56478993,  0.10250187,
        0.66231419,  0.50249882,  1.90902988, -0.09170864,  1.33836494,
        0.41259299, -1.28991465, -0.2016605 ,  0.42102394,  0.09615489,
        1.05050255,  0.88703307, -1.02207773, -0.73787669, -0.23775327,
       -0.22788291,  0.73005777, -0.13474484,  0.61718298, -1.00322438,
        0.07024569, -0.20352355, -0.61256118,  0.26847869,  0.11145235,
       -0.53128436,  1.14164612,  0.66612252,  0.46367256, -0.24197351,
       -0.65837215, -0.78996357,  0.14237623,  0.59782256,  0.3800109 ,
       -0.13495605,  0.27499028,  0.37282278, -1.13507934, -1.33219656,
        0.29463502, -1.13302982, -0.07324211, -0.21025654,  0.22726561,
        0.58235574, -1.16025897, -0.2110797 ,  0.69756547, -2.31751156,
       -0.86672324, -0.86014132,  0.17565813,  1.69355995,  2.26766275,
        0.67113329, -0.76610873,  0.75886229, -0.59728276, -0.23227756,
        1.36822844,  0.36172299, -0.42106324,  2.0277622 ,  1.66001041,
       -0.28778077,  0.22950545, -0.24689063,  0.25064886,  0.39062627,
        0.15197463, -0.11799369,  0.61187383, -1.44587105, -0.92324486,
        0.07860867,  0.44728161,  0.45428826, -0.18109003, -0.45418676,
        0.40011164, -2.18678988, -0.24558306,  0.38069979, -1.08893213,
        0.25404711, -1.33206861,  0.696333  ,  1.21207602, -0.99425883,
        0.11397391, -0.24801316,  0.19138584, -0.11511385, -1.25001005,
        1.34060723, -1.60900724, -1.28998675,  2.16272103,  0.95539349,
       -0.75082776, -1.63705546, -0.14273197,  0.22900889, -0.76408102,
        0.40613099,  0.59467497,  0.3313128 ,  2.73040842,  0.79220729,
       -2.05562017, -0.03145706,  0.98100312, -1.65015798, -0.48739275,
        0.56084474,  1.39769742,  0.35472613, -0.91949727, -0.57348693,
       -0.84205596, -0.74241338, -1.08976319,  0.75298383, -0.72874256,
       -0.94433773, -0.75368591, -1.01026962,  1.01351692, -0.46978444,
       -0.11765867, -0.66931313,  0.62852545,  0.59285157, -1.49270648,
        0.84337733,  0.29262468,  0.3382349 ,  0.05479573,  2.04569299,
       -0.54032173,  1.03110291,  0.70051605, -0.17750657, -0.4253065 ,
        0.16462565, -1.73382532,  0.43030715, -0.01408588, -0.36376801,
        0.73883253,  0.59163004, -0.03217274,  1.25431485,  1.1483354 ,
        0.22158652, -0.74247204, -1.05427364,  0.95818171,  0.09338592,
       -0.6937699 ,  0.36662159,  0.19963607,  0.79610248, -2.28128742,
        0.25299263,  0.07501337,  0.5210424 , -0.5703097 , -1.19843801,
        0.9484448 , -2.12241738,  0.12934798, -1.60129439, -1.2914342 ,
        0.95286272,  0.48729142, -0.06633968, -1.31069109, -1.78757943,
       -0.47480289, -0.53790135,  1.66444307, -0.09050027, -0.02211537,
        0.62482305, -0.10527393, -0.71858299,  1.20094574,  0.8739203 ,
       -0.23804806, -0.22795816,  0.69126858, -0.47264932, -0.65216954,
        1.06394784,  0.58981803,  0.14135372, -1.15460624,  1.01568466,
        0.22496692,  0.61059645, -1.46682516, -0.62297863, -1.50966661,
        0.04332537,  0.19352223, -0.81044135, -0.44267678,  0.77855147,
       -0.09077402, -2.89684205,  0.04866366,  1.01462583, -1.43893917,
       -0.09437792,  1.80692825,  0.71880362,  0.24167572, -0.2875989 ,
        1.33977858, -1.10490946, -0.42067891, -1.44808631,  0.69297779,
        0.3394037 ,  1.08037433,  0.08089568, -0.01648371, -0.99756381,
        1.23878741,  0.96336908, -0.0870192 ,  0.59030172,  0.45589354,
       -0.52639002, -0.64619886,  1.34324173, -0.30986548,  1.28885483,
        2.14527469, -1.95505938,  0.68244507,  0.61780887, -0.61701147,
       -1.15034247, -0.38979183, -0.49749216, -1.20726458,  0.32220358,
        0.43362294, -1.51601017,  1.04766713,  0.52759909, -1.33625436,
       -0.59133401, -0.44240872,  1.00439673,  0.22317639, -0.49224679,
       -0.26218365, -1.6010358 , -0.48418145,  0.69414223, -0.40142694,
       -0.9551921 ,  1.06180801, -0.23415797, -1.58179316, -3.30893201,
       -0.33834046, -0.47320499,  1.38331688, -0.60736471,  1.04385662,
        0.94595183, -2.3626078 , -1.45669826,  0.68908208,  1.54029816,
        2.40763445,  0.39668975, -0.31855929,  2.00507893,  0.81730591,
       -2.39964731, -0.76968894, -0.326282  , -0.36098566, -0.12871749,
        2.19058149, -0.84228076, -1.87107938, -0.30118531, -1.52943922,
        1.48869795, -0.6725605 ,  0.11570184,  0.32977044, -0.36746948,
        0.00716669, -2.57510736, -0.41264814,  1.10205757, -0.75438433,
        0.31148765, -0.24413826, -0.83265658,  0.76981687,  0.04178096,
       -0.21309226,  0.42297187,  1.73631533,  0.26218172,  2.31089513,
        1.13266977,  0.97478285,  0.14144715,  0.08588022, -0.03014989,
        0.72741973, -0.49047502, -0.84093576,  0.31833692, -0.30404667,
        0.70558798, -0.81057593, -1.14412512, -0.49475192, -0.69889574,
       -1.39765421, -2.00943187,  1.14140444,  0.14154376, -0.15156433,
       -1.8142049 ,  0.57325284, -1.16078882,  0.67678341, -0.99591309,
       -0.46301326,  1.32240635,  0.46049138,  0.52819519,  0.63844656,
        0.37593291, -0.17827891, -0.47512573, -0.84264447,  0.60391966,
        0.337164  , -0.8847087 , -0.63110146,  0.98975676, -1.32466655,
       -0.06746252,  1.02223589,  0.26693049, -0.62041243, -1.49561295,
       -0.69676831,  1.20036251, -1.26262635,  0.77832972,  0.79187357,
       -0.4395843 , -1.00398144, -0.12618362, -0.15092739, -0.36059982,
       -0.20120239, -1.18243353, -0.58739658,  0.10151263, -1.55935642,
       -0.83529585, -0.06017497, -0.8552589 , -0.29000119, -0.22589151,
       -2.44686465, -0.34885801,  0.383392  , -0.44178529,  0.81769905,
       -0.80059404, -0.23893545, -0.11836164, -0.62896106,  1.23654526,
       -0.33048341, -0.19320124, -0.06714863, -1.55017514,  0.98118589,
        0.61862047, -1.52206426,  1.15692279,  0.78543049,  0.34300185,
       -1.04513538, -0.81177955,  1.54053038, -1.17053965, -0.37291204,
        1.58040325, -0.46184042, -0.07594866, -1.40037884,  0.76020494,
        0.63234969, -1.14205245, -0.97167682,  0.24486995, -1.73609379,
       -1.51237959,  0.01783905,  0.99936194, -0.96784727,  1.42787399,
       -1.10149129,  0.44034282, -1.00848709, -0.95924063, -0.47190512,
        0.14444788,  0.10925152,  1.3772943 , -1.06758431, -0.85046543,
        0.59040537,  1.64831846,  1.17261886,  1.20878741,  1.52738914,
       -3.77025706, -0.62371225,  0.04551842, -0.119256  ,  1.24747571,
       -0.42023681,  0.11616466,  0.26261253, -1.06943214, -1.51949743,
        0.17142987, -0.92458648,  1.09069295,  1.14880767,  0.74331619,
       -1.73196612,  0.66271492, -0.7038014 ,  0.03680449,  0.71235235,
        0.82557566,  1.62638296,  1.39935181,  2.49106199,  0.14985698,
       -1.46148464, -0.04146449,  0.49462342, -0.98902305, -0.7018344 ,
        0.20683648, -0.24635839,  0.04000294,  0.27791709,  0.21078585,
       -0.92736035, -0.37886541, -0.58310996,  0.49224978, -0.67602573,
        0.77668157,  1.52836502, -1.44769626,  0.54328261,  1.28705262,
        0.87428765,  0.11123177,  0.21881534, -1.61907633,  0.03093875,
       -0.83902034, -0.73302466,  0.58047399, -0.41192683,  0.02118475,
       -0.71282131, -0.51081402, -0.44739775,  0.83614283, -0.73020263,
       -0.16434219,  0.46585986,  0.3626709 ,  1.86382574,  0.9167365 ,
       -0.25454472, -1.10943419,  0.35432446, -0.70900836, -0.01124771,
        1.11889418, -0.96067389,  1.08751532,  0.20486109,  1.13435938,
        0.36114717, -1.84423893,  0.43587852, -1.23724818, -0.94363199,
       -0.05406957, -0.83057112,  0.43342909,  1.49299826,  0.6726023 ,
        0.79090588, -1.16229662,  0.27671211,  0.71728131,  0.75019385,
        1.36621062, -0.18412198,  1.17437643, -1.1044849 , -3.05078802,
       -3.0381736 ,  0.31102293,  1.5253097 , -0.80590403,  0.68225987,
        1.48488093,  0.2880114 ,  1.11060715,  0.91990501, -0.04680686,
        1.01514111,  0.27024187,  0.72358259, -0.17078413, -0.89497358,
        1.02001323, -1.44150331, -0.01026165, -1.1524165 , -0.46741935,
        0.3012979 , -0.00983538,  0.86768755, -1.14010055,  0.15919744,
        0.46433353,  0.08175804, -2.13893201, -0.77538885, -0.75864629,
       -1.66891998,  0.95753807,  0.3690869 , -0.68036373, -0.76547721,
        1.66840636, -0.51553559, -0.0755348 ,  0.31863687,  0.51850443,
       -0.76445796, -0.0855151 , -0.60591392, -0.65218307,  0.1147738 ,
        0.77644411,  0.25425077, -0.89716003, -0.20124402, -0.56435449,
        0.0642809 , -1.22216863, -0.48501633,  0.31912962,  1.18340336,
       -2.4595049 ,  0.63365252,  0.74901843,  0.06542558, -0.47787032,
        1.47593397,  0.18263868,  0.78736493,  1.43470817,  0.56782932,
       -2.2365696 ,  1.40374656, -0.49313063,  1.15017725,  1.96978264,
        1.31907724,  1.41619119,  1.01667103, -0.45892636, -0.05953744,
       -0.98853503,  0.05358639, -1.37612562,  0.61982116,  0.30859072,
        0.33037186, -2.14127322, -0.007489  , -0.2860277 , -0.46709707,
       -1.55990525,  1.55048099,  0.74536514,  1.24928054, -0.29925512,
       -1.33039666, -0.62414841, -2.07098784, -0.70382393,  0.12174123,
       -1.25544193, -1.51318771,  0.21162602,  0.65026529,  0.0969602 ,
       -0.44195702, -0.31153557, -0.77717941, -0.28494665, -0.43005638,
       -0.57974473,  1.64025079, -0.42883973,  0.16362589,  0.2382349 ,
       -0.88991744, -0.11572232, -1.50386494, -0.34202158, -1.67319897,
       -0.01385458, -0.85956579, -1.26366253,  1.482794  ,  1.60453777,
       -0.19433618, -0.91076347, -1.36233156, -0.27961982,  0.37500048,
       -0.19551415,  0.85801874,  1.4707409 , -0.28560999, -1.33815874,
        1.44428958, -0.87030591, -2.00556388,  0.5511236 , -0.07108374,
       -1.19593785,  0.68408383,  1.30285424, -2.07498375,  0.54261329,
       -0.6994806 , -1.05664508,  0.84476848, -0.83385195,  1.40364832,
       -0.72119991,  0.46652931, -1.88387344, -1.16486648, -1.88514184,
        1.46014356, -1.11634514, -0.2707258 , -1.14093973,  0.07959302,
        0.07542824,  0.14846464, -0.36521061, -0.30470862,  2.48119895,
        0.38541437, -0.10761774, -1.69413777,  0.76778963, -0.81251414,
       -0.68865002, -1.4581722 , -0.5329172 , -1.76570583,  1.36341038,
        0.44672339, -0.2873276 , -0.19345529, -0.35432086,  2.30257714,
        0.2031093 , -0.75540299, -0.25758936, -0.54762558, -0.2541016 ,
       -0.43432472, -0.11003426, -2.10775395, -0.84592379, -0.09595562,
       -0.20394318, -0.19207982, -0.34482914,  0.14990411,  1.11549487,
       -1.25747376,  0.68432239, -0.16760485,  0.81963624, -0.19319738,
        0.22345952, -0.10516297,  0.34185092, -1.0161382 ,  1.07644801,
        0.95637511,  0.15747391,  0.66232136, -1.03005582, -0.4302984 ,
        0.7778018 , -1.63593356, -0.63525271, -0.65500382,  1.57037947,
        1.92466761,  1.85749027,  0.5692625 ,  0.38830644,  0.22666263,
        0.563722  ,  0.32253848,  0.5166061 , -0.13062329,  1.11097066,
        0.03724634, -1.41103779,  0.54237506, -1.00846822,  1.15176472,
       -0.90490281,  0.15094332,  0.23112132,  1.08171599,  0.54748573,
       -0.50828166,  0.55036112,  0.23370863,  0.2447713 ,  0.39726808])

In [98]:
cats = pd.qcut(data, 4) #distribute data into 4 quartiles

In [99]:
cats.value_counts()

(-3.771, -0.702]     250
(-0.702, -0.0379]    250
(-0.0379, 0.653]     250
(0.653, 2.73]        250
dtype: int64

In [100]:
pd.qcut(data, 6).value_counts()

(-3.771, -0.995]     167
(-0.995, -0.443]     167
(-0.443, -0.0379]    166
(-0.0379, 0.376]     167
(0.376, 0.961]       166
(0.961, 2.73]        167
dtype: int64

In [101]:
pd.qcut(data, [0, 0.20, 0.40, 0.60, 0.80, 1]).value_counts()

(-3.771, -0.844]    200
(-0.844, -0.254]    200
(-0.254, 0.22]      200
(0.22, 0.791]       200
(0.791, 2.73]       200
dtype: int64

## Detecting and Filtering Outliers

In [102]:
data = pd.DataFrame(data=np.random.randn(1000, 4))

In [103]:
data

            0         1         2         3
0    0.416640  0.795114 -0.743435  1.111822
1   -0.446112 -0.018319 -0.657937  1.465648
2    0.877370  0.179955  0.838285  0.962178
3   -1.626815  0.605235 -0.281931 -1.364533
4    1.173010  0.793466  1.010796  0.382796
..        ...       ...       ...       ...
995 -1.380163 -0.244628 -0.527992  2.215075
996 -1.017890  0.632673 -0.662727  0.790172
997 -0.353166  1.614957 -0.999091  0.278586
998  0.721523  0.375522  0.531194  0.364769
999 -1.847411  2.937027 -0.361387  0.492585

[1000 rows x 4 columns]

In [104]:
data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean     -0.016652     0.047012    -0.054445    -0.003360
std       1.042345     1.030181     0.986705     0.975111
min      -3.707654    -3.268194    -3.246817    -2.943873
25%      -0.692866    -0.651794    -0.698734    -0.681022
50%      -0.027341     0.063683    -0.042863    -0.045815
75%       0.721098     0.739424     0.610927     0.672786
max       3.667291     3.082116     2.985314     3.510821

In [105]:
col_2 = data[2]

In [106]:
col_2[np.abs(col_2) > 3]

19    -3.246817
501   -3.025978
Name: 2, dtype: float64

In [107]:
#To select all rows having a value exceeding 3 or –3
data[(np.abs(data) > 3).any(1)]

            0         1         2         3
19  -0.049701 -1.000427 -3.246817  0.558937
121  0.139453 -3.268194 -0.126937  0.382325
157 -0.192505  3.082116 -1.317084  0.482158
213  0.660247  0.603671 -1.112599  3.510821
501 -1.800008  1.422605 -3.025978  0.092752
743  3.667291  1.205293 -1.073897 -0.629957
779  0.657757 -3.079998  0.589954 -0.946266
840 -3.065402 -0.330182 -0.037440 -2.007581
877  3.164556 -0.302388  0.388238 -1.123943
956 -3.707654 -0.167246  0.408062 -1.159327

In [108]:
data[(np.abs(data) > 3)] = np.sign(data) * 3

In [109]:
data

            0         1         2         3
0    0.416640  0.795114 -0.743435  1.111822
1   -0.446112 -0.018319 -0.657937  1.465648
2    0.877370  0.179955  0.838285  0.962178
3   -1.626815  0.605235 -0.281931 -1.364533
4    1.173010  0.793466  1.010796  0.382796
..        ...       ...       ...       ...
995 -1.380163 -0.244628 -0.527992  2.215075
996 -1.017890  0.632673 -0.662727  0.790172
997 -0.353166  1.614957 -0.999091  0.278586
998  0.721523  0.375522  0.531194  0.364769
999 -1.847411  2.937027 -0.361387  0.492585

[1000 rows x 4 columns]

In [110]:
data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean     -0.016711     0.047278    -0.054173    -0.003871
std       1.037238     1.028872     0.985859     0.973401
min      -3.000000    -3.000000    -3.000000    -2.943873
25%      -0.692866    -0.651794    -0.698734    -0.681022
50%      -0.027341     0.063683    -0.042863    -0.045815
75%       0.721098     0.739424     0.610927     0.672786
max       3.000000     3.000000     2.985314     3.000000

In [117]:
np.sign(data).head()

     0    1    2    3
0  1.0  1.0 -1.0  1.0
1 -1.0 -1.0 -1.0  1.0
2  1.0  1.0  1.0  1.0
3 -1.0  1.0 -1.0 -1.0
4  1.0  1.0  1.0  1.0

## Permutation and Random Sampling

Permuting (randomly reordering) a Series or the rows in a DataFrame is easy to do
using the numpy.random.permutation function.

In [118]:
df = pd.DataFrame(data=(np.arange(5*4).reshape(5, 4)))

In [119]:
df

    0   1   2   3
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15
4  16  17  18  19

In [130]:
sampler = np.random.permutation(df.shape[0])

In [131]:
sampler

array([4, 1, 2, 0, 3])

In [135]:
df.take(sampler)

    0   1   2   3
4  16  17  18  19
1   4   5   6   7
2   8   9  10  11
0   0   1   2   3
3  12  13  14  15

In [134]:
#To select a random subset without replacement, you can use the sample method on Series and DataFrame
df.sample(n=3)

    0   1   2   3
0   0   1   2   3
4  16  17  18  19
1   4   5   6   7

In [139]:
choices = ser = pd.Series([5, 7, -1, 6, 4])

In [140]:
draws = ser.sample(n=10, replace=True)

In [141]:
draws

4    4
2   -1
0    5
4    4
4    4
1    7
3    6
4    4
4    4
2   -1
dtype: int64

## Computing Indicator/Dummy Variables

Another type of transformation for statistical modeling or machine learning applications is converting a categorical variable into a “dummy” or “indicator” matrix. If a
column in a DataFrame has k distinct values, you would derive a matrix or DataFrame with k columns containing all 1s and 0s.

In [142]:
df = pd.DataFrame({'key': ['b', 'b', 'a', 'c', 'a', 'b'], 'data1': range(6)})

In [143]:
df

  key  data1
0   b      0
1   b      1
2   a      2
3   c      3
4   a      4
5   b      5

In [145]:
dummies = pd.get_dummies(df['key'])

In [146]:
dummies

   a  b  c
0  0  1  0
1  0  1  0
2  1  0  0
3  0  0  1
4  1  0  0
5  0  1  0

In [185]:
df_with_dummy = pd.get_dummies(df['key'], prefix='key')
df_with_dummy = df[['data1']].join(df_with_dummy)

In [184]:
df_with_dummy

   data1  key_a  key_b  key_c
0      0      0      1      0
1      1      0      1      0
2      2      1      0      0
3      3      0      0      1
4      4      1      0      0
5      5      0      1      0

In [151]:
mnames = ['id','movie_id', 'title', 'genre']

In [162]:
movies = pd.read_table('movielens/movies.dat', sep='::', header=None, names=mnames)

C:\Users\ABC\anaconda3\lib\site-packages\ipykernel_launcher.py:1: ParserWarning: Falling back to the 'python' engine because the 'c' engine does not support regex separators (separators > 1 char and different from '\s+' are interpreted as regex); you can avoid this warning by specifying engine='python'.
  """Entry point for launching an IPython kernel.

In [163]:
movies

,movie_id,title,genre
0,1,Toy Story (1995),Animation|Children's|Comedy
1,2,Jumanji (1995),Adventure|Children's|Fantasy
2,3,Grumpier Old Men (1995),Comedy|Romance
3,4,Waiting to Exhale (1995),Comedy|Drama
4,5,Father of the Bride Part II (1995),Comedy
...,...,...,...
3878,3948,Meet the Parents (2000),Comedy
3879,3949,Requiem for a Dream (2000),Drama
3880,3950,Tigerland (2000),Drama
3881,3951,Two Family House (2000),Drama
3882,3952,"Contender, The (2000)",Drama|Thriller

In [171]:
all_genre = []

In [172]:
for genre in movies['genre']:
    all_genre.extend(genre.split('|'))

In [178]:
pd.value_counts(all_genre)

Drama          1603
Comedy         1200
Action          503
Thriller        492
Romance         471
Horror          343
Adventure       283
Sci-Fi          276
Children's      251
Crime           211
War             143
Documentary     127
Musical         114
Mystery         106
Animation       105
Fantasy          68
Western          68
Film-Noir        44
dtype: int64

In [198]:
genre = pd.unique(all_genre)

In [199]:
genre

array(['Animation', "Children's", 'Comedy', 'Adventure', 'Fantasy',
       'Romance', 'Drama', 'Action', 'Crime', 'Thriller', 'Horror',
       'Sci-Fi', 'Documentary', 'War', 'Musical', 'Mystery', 'Film-Noir',
       'Western'], dtype=object)

In [201]:
zero_matrix = np.zeros((len(movies), len(genre)))

In [202]:
zero_matrix

array([[0., 0., 0., ..., 0., 0., 0.],
       [0., 0., 0., ..., 0., 0., 0.],
       [0., 0., 0., ..., 0., 0., 0.],
       ...,
       [0., 0., 0., ..., 0., 0., 0.],
       [0., 0., 0., ..., 0., 0., 0.],
       [0., 0., 0., ..., 0., 0., 0.]])

In [203]:
dummies = pd.DataFrame(data=zero_matrix, columns=genre)

In [204]:
dummies

,Animation,Children's,Comedy,Adventure,Fantasy,Romance,Drama,Action,Crime,Thriller,Horror,Sci-Fi,Documentary,War,Musical,Mystery,Film-Noir,Western
0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
1,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
2,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
3,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
4,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
3878,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
3879,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
3880,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
3881,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
3882,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0

In [205]:
for i, gen in enumerate(movies['genre']):
    indices = dummies.columns.get_indexer(gen.split('|'))
    dummies.iloc[i, indices] = 1

In [206]:
dummies

,Animation,Children's,Comedy,Adventure,Fantasy,Romance,Drama,Action,Crime,Thriller,Horror,Sci-Fi,Documentary,War,Musical,Mystery,Film-Noir,Western
0,1.0,1.0,1.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
1,0.0,1.0,0.0,1.0,1.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
2,0.0,0.0,1.0,0.0,0.0,1.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
3,0.0,0.0,1.0,0.0,0.0,0.0,1.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
4,0.0,0.0,1.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
3878,0.0,0.0,1.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
3879,0.0,0.0,0.0,0.0,0.0,0.0,1.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
3880,0.0,0.0,0.0,0.0,0.0,0.0,1.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
3881,0.0,0.0,0.0,0.0,0.0,0.0,1.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
3882,0.0,0.0,0.0,0.0,0.0,0.0,1.0,0.0,0.0,1.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0

In [208]:
final_dummy = movies[['movie_id', 'title']].join(dummies)

In [209]:
final_dummy

,movie_id,title,Animation,Children's,Comedy,Adventure,Fantasy,Romance,Drama,Action,Crime,Thriller,Horror,Sci-Fi,Documentary,War,Musical,Mystery,Film-Noir,Western
0,1,Toy Story (1995),1.0,1.0,1.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
1,2,Jumanji (1995),0.0,1.0,0.0,1.0,1.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
2,3,Grumpier Old Men (1995),0.0,0.0,1.0,0.0,0.0,1.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
3,4,Waiting to Exhale (1995),0.0,0.0,1.0,0.0,0.0,0.0,1.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
4,5,Father of the Bride Part II (1995),0.0,0.0,1.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
3878,3948,Meet the Parents (2000),0.0,0.0,1.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
3879,3949,Requiem for a Dream (2000),0.0,0.0,0.0,0.0,0.0,0.0,1.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
3880,3950,Tigerland (2000),0.0,0.0,0.0,0.0,0.0,0.0,1.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
3881,3951,Two Family House (2000),0.0,0.0,0.0,0.0,0.0,0.0,1.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
3882,3952,"Contender, The (2000)",0.0,0.0,0.0,0.0,0.0,0.0,1.0,0.0,0.0,1.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0

A useful recipe for statistical applications is to combine get_dummies with a discretization function like cut:

In [210]:
np.random.seed(12345)

In [211]:
values = np.random.rand(10)

In [212]:
values

array([0.92961609, 0.31637555, 0.18391881, 0.20456028, 0.56772503,
       0.5955447 , 0.96451452, 0.6531771 , 0.74890664, 0.65356987])

In [213]:
bins = [0, 0.2, 0.4, 0.6, 0.8, 1]

In [214]:
dummies = pd.get_dummies(pd.cut(values, bins))

In [215]:
dummies

   (0.0, 0.2]  (0.2, 0.4]  (0.4, 0.6]  (0.6, 0.8]  (0.8, 1.0]
0           0           0           0           0           1
1           0           1           0           0           0
2           1           0           0           0           0
3           0           1           0           0           0
4           0           0           1           0           0
5           0           0           1           0           0
6           0           0           0           0           1
7           0           0           0           1           0
8           0           0           0           1           0
9           0           0           0           1           0

# 7.3 String Manipulation

## String Object Methods

In [216]:
val = 'a, b, guido, github'

In [217]:
val.split(',') #string can be broken into pieces with split()

['a', ' b', ' guido', ' github']

In [219]:
#split is often combined with strip to trim whitespace (including line breaks):
pieces = [x.strip() for x in val.split(',')]

In [220]:
pieces

['a', 'b', 'guido', 'github']

In [221]:
first, second, third, fourth = pieces

In [224]:
first + "::" + second + "::" + third + "::" + fourth #Not a practical generic method

'a::b::guido::github'

In [225]:
"::".join(pieces)

'a::b::guido::github'

In [226]:
val

'a, b, guido, github'

In [233]:
'guido' in val

True

In [234]:
val.find('g')

6

In [229]:
val.find(':')

-1

In [231]:
val.index('g')

6

In [237]:
"val.index(':')" #Raises an exception of ValueError

"val.index(':')"

In [238]:
val.count(',')

3

In [239]:
val.count('g')

2

In [240]:
val.count(':')

0

In [241]:
val

'a, b, guido, github'

In [242]:
val.replace(', ', '::')

'a::b::guido::github'

In [246]:
a = val.replace(',', ' ')

In [249]:
a

'a  b  guido  github'

See Table 7-3 for a listing of some of Python’s string methods.

In [250]:
val = "Dilory Pam Pah Pah Pa Rara Ra"

In [254]:
val.endswith('a Ra')

True

In [257]:
val.startswith('Dilo')

True

In [260]:
val.rfind('Ra') #index of 'R'

27

## Regular Expressions

Regular expressions provide a flexible way to search or match (often more complex)
string patterns in text. A single expression, commonly called a regex, is a string
formed according to the regular expression language.

The re module functions fall into three categories: pattern matching, substitution,
and splitting.

In [263]:
import re

In [267]:
text = "My    name     is          Danish Hudani"

In [276]:
regex = re.compile('\s+') #One or more white spaces

In [277]:
regex.split(text)

['My', 'name', 'is', 'Danish', 'Hudani']

In [278]:
regex.findall(text)

['    ', '     ', '          ', ' ']

In [279]:
print(r'C:\x') #instead of

C:\x

In [280]:
print('C:\\x')

C:\x

In [311]:
text = """Dave dave@google.com
Steve steve@gmail.com
Rob rob@gmail.com
Ryan ryan@yahoo.com
"""

In [312]:
pattern = r'[A-Z0-9._%+-]+@[A-Z0-9.-]+.[A-Z]'

In [313]:
regex = re.compile(pattern, flags=re.IGNORECASE)

In [314]:
regex.findall(text)

['dave@google.com', 'steve@gmail.com', 'rob@gmail.com', 'ryan@yahoo.com']

In [315]:
m = regex.search(text) #searches the 1st object

In [316]:
m

In [322]:
text[m.start():m.end()]

'dave@google.com'

In [324]:
print(regex.sub('REDACTED', text))

Dave REDACTED
Steve REDACTED
Rob REDACTED
Ryan REDACTED

In [333]:
pattern =  r'([A-Z0-9._%+-]+)@([A-Z0-9.-]+)\.([A-Z]{2,4})'

In [334]:
regex = re.compile(pattern, flags=re.IGNORECASE)

In [335]:
m = regex.match('danish.hud95@gmail.com')

In [336]:
m

In [337]:
m.groups()

('danish.hud95', 'gmail', 'com')

In [338]:
regex.findall(text)

[('dave', 'google', 'com'),
 ('steve', 'gmail', 'com'),
 ('rob', 'gmail', 'com'),
 ('ryan', 'yahoo', 'com')]

In [342]:
print(regex.sub(r'Username: \1, Domain: \2, Suffix: \3', text))

Dave Username: dave, Domain: google, Suffix: com
Steve Username: steve, Domain: gmail, Suffix: com
Rob Username: rob, Domain: gmail, Suffix: com
Ryan Username: ryan, Domain: yahoo, Suffix: com

Table 7-4. Regular expression methods